app/controllers/comments_controller.rb

def index
  @comments = Comment.all.order('updated_at ASC')
---
SELECT "comments".* FROM "comments"  ORDER BY updated_at ASC

def create
  @post = Post.find params[:post_id]
  @comment = @current_user.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("comm", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comm", "totes"], ["user_id", 2], ["created_at", "2015-07-30 04:41:47.294331"], ["updated_at", "2015-07-30 04:41:47.294331"]]