app/controllers/posts_controller.rb

  def create
    uploaded_file_path = params[:post][:image].path
    cloudinary_file = Cloudinary::Uploader.upload(uploaded_file_path)
    @post = current_user.posts.create(desc: params[:post][:desc],image: cloudinary_file['public_id'])
---
INSERT INTO "posts" ("desc", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["desc", "hero"], ["image", "t6jtnegjtboyw3gwwyso"], ["user_id", 2], ["created_at", "2015-07-28 19:09:40.056847"], ["updated_at", "2015-07-28 19:09:40.056847"]]

  def update
    @post = Post.find(params[:id])
    @post.update(desc: params[:post][:desc])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "desc" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["desc", "tennis mirrors yo!"], ["updated_at", "2015-07-29 18:01:27.883889"], ["id", 6]]

  def destroy
    @post = Post.find(params[:id]).delete
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]